Ybbor7456/stm32l432kc-baremetal/drivers/hal.h
static inline void exti_init(uint16_t pin){
  uint32_t line = PINNO(pin);
  exti_route(pin); 
  exti_enable_falling(line); 
}

static inline void nvic_set_priority(unsigned irqn, uint8_t prio) {
  NVIC_IPR[irqn] = prio;   // works; exact effective bits depend on implementation
}

static inline void nvic_enable_irq(unsigned irqn) {
  if (irqn < 32) NVIC_ISER0 = (1u << irqn);
  else NVIC_ISER1 = (1u << (irqn - 32));
}

static inline void enable_interrupts_exti9_5(void){
  nvic_set_priority(IRQ_EXTI9_5, 0x80);   // mid priority; 0x00 = highest
  nvic_enable_irq(IRQ_EXTI9_5);
  //irq_global_enable();                   // optional if already enabled elsewhere
}

static inline void button_exti_init(uint16_t pin){
  button_gpio_init(pin);          // pin input + pull
  exti_init(pin);                 // riggers + route
  enable_interrupts_exti9_5();    // NVIC
  //irq_global_enable();            
}

static inline void irq_global_enable(void){ 
  __asm volatile ("cpsie i");
}

static inline void irq_global_disable(void) {
  __asm volatile ("cpsid i");
}

static inline void adc_gpio_init(uint16_t pin, uint16_t conf){ 
  gpio_enable(pin); 
  gpio_set_mode(pin, GPIO_MODE_ANALOG); 
  gpio_set_pupd(pin, conf)
}

static inline void dma_adc_clock_enable(void){
  RCC->AHB1ENR |= BIT(0); // sets 1 to bit 0
  RCC->AHB2ENR |= BIT(13);  
}

static inline void adc_stable_calibration_state(){
  // if a conversion is running, end it
  if (ADC1->CR & BIT(2)) {              
    ADC1->CR |= BIT(4);
    while (adc->CR & BIT(4)) (void)0;  // waiting to avoid race conditons 
    while (adc->CR & BIT(2)) (void)0;
  }
  // if ADC is enabled, disable it
  if (ADC1->CR & BIT(0)) {              
    ADC1->CR |= BIT(1);
    while (adc->CR & BIT(0)) (void)0;
  }
  // callibrate 
  ADC1->CR |= BIT(31);
  while (adc->CR & BIT(31)) (void)0;
}

static inline void adc_set_configs(uint8_t res_bit, bool left_align, bool conv_mode, uint8_t pin){
  // can only set res when adstart and jadstart are 0
  if (ADC1->CR & BIT(2)) {              
    ADC1->CR |= BIT(4);
    while (ADC1->CR & BIT(4)) (void)0;     // wait ADSTP clears
    while (ADC1->CR & BIT(2)) (void)0;     // wait ADSTART clears
  } // stops the conv. 
  ADC1->CFGR &= ~(3U << 3U); 
  ADC1->CFGR |= ((res_bit & 3) << 3U); 
  if(left_align) ADC1->CFGR |= BIT(5); //align left
  else ADC1->CFGR &= ~BIT(5);
  if(conv_mode) ADC1->CFGR |= BIT(13);
  else ADC1->CFGR &= ~BIT(13); 
  ADC1->CFGR |= BIT(0); // setting DMA enable only (for now)
  ADC1->CFGR &= ~BIT(1); // set single-shot for now
  gpio_set_pupd(pin, NO_PULL); 
}

static inline void adc_set_sequence(uint8_t len, uint8_t ch, uint8_t sample_rate){
   if (ADC1->CR & BIT(2)) {              
    ADC1->CR |= BIT(4);
    while (ADC1->CR & BIT(4)) (void)0;     // wait ADSTP clears
    while (ADC1->CR & BIT(2)) (void)0;     // wait ADSTART clears
  } // stops the conv. 
  // clear and set conv bits
  ADC1->SQR1 = (ADC1->SQR1 & ~((0xFU << 0) | (0x1FU << 6)))
  | ((len & 0xFU) << 0)   // L[3:0]
  | ((ch & 0x1FU) << 6); // SQ1[4:0]
  // set sample time
  ADC1->SMPR1 = (ADC1->SMPR1 & ~(0x7U << 24)) | ((sample_rate & 0x7U)<<24); 
}

static inline void set_dma_configs(uint8_t channel, uint8_t request_id){
  //enable clock, pick channel, clear interrupt flag, CSELR mapping: route ADC request → your DMA channel
  dma_adc_clock_enable(); 
  // selecting DMA channel. 
  uint8_t n = channel - 1; 
  DMA1->CSELR = (DMA1->CSELR & ~(0xFU << n*4U)) | ((request_id & 0xFU) << n*4U);

  DMA1->CCRx &= ~BIT(0); // clear dma channel
  DMA1->IFCR &= ~BIT(0); // clear global interrupt flag clear
  DMA1->IFCR |= BIT(0); // set global interrupt flag clear
}

void EXTI9_5_IRQHandler(void);

static inline void exti_sw_trigger(uint32_t line) {
  EXTI->SWIER1 |= BIT(line);
}

static inline void i2c_gpio_init(uint16_t scl, uint16_t sda, uint8_t af) {
  gpio_set_mode(scl, GPIO_MODE_AF);
  gpio_set_af(scl, af);
  gpio_set_open_drain(scl);
  //gpio_set_pullup(scl);            //uses external pull-ups
  gpio_set_speed(scl);

  gpio_set_mode(sda, GPIO_MODE_AF);
  gpio_set_af(sda, af);
  gpio_set_open_drain(sda);
  //gpio_set_pullup(sda);            //external pull-ups
  gpio_set_speed(sda);
}

static inline void rcc_i2c_select_hsi(struct i2c *i2c) {
  // HSI ison as a peripheral clock
  RCC->CR |= BIT(8);  // bit 8 HSION 

  if (i2c == I2C1) {
    RCC->CCIPR = (RCC->CCIPR & ~(3U << 12)) | (2U << 12); // target, clear, and set bits 12 and 13 to set 10 to target HSI as lcock
  } else if (i2c == I2C3) {
    RCC->CCIPR = (RCC->CCIPR & ~(3U << 16)) | (2U << 16); 
  }
}

static inline bool i2c_bus_idle(uint16_t scl, uint16_t sda) {
  return gpio_read_pin(scl) && gpio_read_pin(sda);
}

static inline int i2c_wait_flag_set(volatile uint32_t *reg, uint32_t mask, uint32_t timeout) {
  while (((*reg) & mask) == 0) {
    if (timeout-- == 0) return I2C_ERR_TIMEOUT;
  }
  return I2C_OK;
}

static inline int i2c_write(struct i2c *i2c, uint8_t addr7, const uint8_t *buf, size_t len) {
  // checks if BUS is busy
  if (i2c->ISR & BIT(15)) return I2C_ERR_BUSY;

  i2c->ICR = BIT(5) | BIT(4) | BIT(8) | BIT(9); // writing 1 to these clears error flags 

  // For writes longer than 255 bytes, use RELOAD and wait for TCR between chunks.
  // TCR - Transfer Control Reload, register that works specifically with the RELOAD bit to handle data transfers larger than 255 bytes
  while (len > 0) {
    uint32_t chunk = (len > 255) ? 255 : (uint32_t)len;
    uint32_t last  = (len <= 255);

    // Build CR2: 7-bit address goes into SADD field shifted by 1 on STM32 I2C v2.
    // (SADD holds the address in bits [7:1]; bit0 is 0 for 7-bit addressing)
    uint32_t cr2 = 0;
    cr2 |= ((uint32_t)(addr7 << 1) << 0);   
    cr2 |= (chunk << 16);
    // RD_WRN = 0 for write
    if (!last) cr2 |= BIT(24);          // more bytes to come
    if (last)  cr2 |= BIT(25);         // auto STOP after last byte
    cr2 |= BIT(13);                      // generate START
    // Write CR2 (note: avoid accidentally leaving STOP/START bits set from earlier use)
    i2c->CR2 = cr2;
    // Send this chunk
    for (uint32_t i = 0; i < chunk; i++) {
      // Wait until TXDR is ready (TXIS), or error occurs
      uint32_t timeout = 1000000;
      while (((i2c->ISR & BIT(1)) == 0)) {
        uint32_t isr = i2c->ISR;

        if (isr & BIT(4)) {
          i2c->ICR = BIT(4);
          i2c->CR2 |= BIT(14);
          return I2C_ERR_NACK;
        }
        if (isr & BIT(8)) {
          i2c->ICR = BIT(8);
          i2c->CR2 |= BIT(14);
          return I2C_ERR_BUS;
        }
        if (isr & BIT(9)) {
          i2c->ICR = BIT(9); 
          return I2C_ERR_ARLO;
        }
        if (timeout-- == 0) {
          i2c->CR2 |= BIT(14); // bit(14) cr2_STOP
          return I2C_ERR_TIMEOUT;
        }
      }
      // Write next byte
      i2c->TXDR = *buf++;
  }
   // End-of-chunk handling
    if (!last) {
      // Wait for TCR (Transfer Complete Reload) before programming next chunk
      int rc = i2c_wait_flag_set(&i2c->ISR, BIT(7), 1000000);
      if (rc != I2C_OK) {
        i2c->CR2 |= BIT(14);
        return rc;
        }
      } 
      else {  
      // Wait for STOPF (AUTOEND generates STOP automatically)
      int rc = i2c_wait_flag_set(&i2c->ISR, BIT(5), 1000000);
      if (rc != I2C_OK) {
        i2c->CR2 |= BIT(14);
        return rc;
      }
      // Clear STOPF
      i2c->ICR = BIT(5);
    }

    len -= chunk;
  }
  return I2C_OK;
}

static inline int i2c_read(struct i2c *i2c, uint8_t addr7, uint8_t *buf, size_t len ){
  // checks if BUS is busy
  // 1. Clear flags
  if (i2c->ISR & BIT(15)) return I2C_ERR_BUSY;
  i2c->ICR = BIT(5) | BIT(4) | BIT(8) | BIT(9); // writing 1 to these clears error flags 

  while (len > 0) {
    uint32_t chunk = (len > 255) ? 255 : (uint32_t)len;
    uint32_t last  = (len <= 255);
    //2. set CR2 (SADD, RD_WRN=1, NBYTES, START, AUTOEND/RELOAD
    
    uint32_t cr2 = 0;
    cr2 |= ((uint32_t)(addr7 << 1));   // set SADD
    cr2 |= (chunk << 16);                   // NBYTES = chunk
    cr2 |= BIT(10);               // set RD_WRN
    if (!last) cr2 |= BIT(24);          // more bytes to come
    if (last)  cr2 |= BIT(25);         // auto STOP after last byte
    cr2 |= BIT(13); // set START
    i2c->CR2 = cr2;
    for (uint32_t i = 0; i < chunk; i++) {
      uint32_t timeout = 1000000; 
      while (((i2c->ISR & BIT(2)) == 0)) { // BIT(1) is TXIS, change from  to TXIS to BIT(2) RXNE
        uint32_t isr = i2c->ISR;
        if (isr & BIT(4)) {
          i2c->ICR = BIT(4);
          i2c->CR2 |= BIT(14);
          return I2C_ERR_NACK;
        }
        if (isr & BIT(8)) {
          i2c->ICR = BIT(8);
          i2c->CR2 |= BIT(14);
          return I2C_ERR_BUS;
        }
        if (isr & BIT(9)) {
          i2c->ICR = BIT(9); 
          return I2C_ERR_ARLO;
        }
        if (timeout-- == 0) {
          i2c->CR2 |= BIT(14); // bit(14) cr2_STOP
          return I2C_ERR_TIMEOUT;
        }
      }
    // read next byte
    *buf++ = (uint8_t)i2c->RXDR;
    }
    if (!last) {
      // Wait for TCR (Transfer Complete Reload) before programming next chunk
      int rc = i2c_wait_flag_set(&i2c->ISR, BIT(7), 1000000);
      if (rc != I2C_OK) {
        i2c->CR2 |= BIT(14);
        return rc;
      }
    } 
    else {  
      // Wait for STOPF (AUTOEND generates STOP automatically)
      int rc = i2c_wait_flag_set(&i2c->ISR, BIT(5), 1000000);
      if (rc != I2C_OK) {
        i2c->CR2 |= BIT(14);
        return rc;
      }
      // Clear STOPF
      i2c->ICR = BIT(5);
    }
    len -= chunk;
  }
  return I2C_OK;
}

//split into phase A and B
/*
The difference is that
an I2C Read command initiates a read from the current address pointer location
in the slave device's memory, while an I2C Read Register command first performs 
a write operation to set the internal register pointer to a specific address before performing the read operation

Phase A - set register pointer, device address + write, send register address byte, wait for TC

Phase B - read the payload. 
STOPF vs TC. 
TC means transfer of bytes complete, don't stop , STOPF -> action completed/AUTOEND

Phase A (write pointer): -> START -> 0x68 + W -> 0x0F ← this is the register address byte -> (no STOP)
Phase B (read data): -> repeated START -> 0x68 + R -> byte0 ← goes into buf[0] -> byte1 ← goes into buf[1] -> STOP
*/

static inline int i2c_read_register(struct i2c *i2c, uint8_t addr7, uint8_t *buf, size_t len, uint8_t reg ){
  //busy check
  if (i2c->ISR & BIT(15)) return I2C_ERR_BUSY;
  i2c->ICR = BIT(5) | BIT(4) | BIT(8) | BIT(9); 
  uint32_t cr2 = 0;
  cr2 |= ((uint32_t)(addr7 & 0x7F) << 1); 
  cr2 |= (1U << 16); 
  cr2 |= BIT(13);  // START
  i2c->CR2 = cr2;
  uint32_t timeout = 1000000;
  while ((i2c->ISR & BIT(1)) == 0) { // TXIS wait on register address byte 
    uint32_t isr = i2c->ISR;
    if (isr & BIT(4)) {  // NACKF received flag
      i2c->ICR = BIT(4);  // NACKF flag cleared
      i2c->CR2 |= BIT(14); // STOP
      return I2C_ERR_NACK;
    }
    if (isr & BIT(8)) { // BERR bus error
      i2c->ICR = BIT(8); // bus error flag clear
      i2c->CR2 |= BIT(14); // stop 
      return I2C_ERR_BUS;
    }
    if (isr & BIT(9)) {  // ARLO
      i2c->ICR = BIT(9); // clears arbitration flag
      return I2C_ERR_ARLO;
    }
    if (timeout-- == 0) {
      i2c->CR2 |= BIT(14); // STOP
      return I2C_ERR_TIMEOUT;
    }
  }
  // wait TC (transfer complete, no STOPF) so there is a repeated START
  i2c->TXDR = reg; // writes register address byte into TXDR
  int rc = i2c_wait_flag_set(&i2c->ISR, BIT(6), 1000000); // transfer complete condition 
  if (rc != I2C_OK) { // if not TC, stop condition generation 
      i2c->CR2 |= BIT(14);
      return rc;
  }
  //Phase B: repeated START + read len bytes
  //Phase B is the actual data coming from the device starting at that register.
  while (len > 0) {
    uint32_t chunk = (len > 255) ? 255 : (uint32_t)len;
    uint32_t last  = (len <= 255);

    cr2 = 0;
    cr2 |= ((uint32_t)(addr7 & 0x7F) << 1); // SADD
    cr2 |= (chunk << 16);                   // NBYTES
    cr2 |= BIT(10);                         // RD_WRN = 1, read
    if (!last) cr2 |= BIT(24);              // RELOAD
    if (last)  cr2 |= BIT(25);              // AUTOEND
    cr2 |= BIT(13);                         // STARTx2
    i2c->CR2 = cr2;
    // read chunk bytes
    for (uint32_t i = 0; i < chunk; i++) {
      timeout = 1000000;
      while ((i2c->ISR & BIT(2)) == 0) {    // RXNE
        uint32_t isr = i2c->ISR;
        if (isr & BIT(4)) {                 // NACKF
          i2c->ICR = BIT(4);
          i2c->CR2 |= BIT(14);
          return I2C_ERR_NACK;
        }
        if (isr & BIT(8)) {                 // BERR
          i2c->ICR = BIT(8);
          i2c->CR2 |= BIT(14);
          return I2C_ERR_BUS;
        }
        if (isr & BIT(9)) {                 // ARLO
          i2c->ICR = BIT(9);
          return I2C_ERR_ARLO;
        }
        if (timeout-- == 0) {
          i2c->CR2 |= BIT(14);
          return I2C_ERR_TIMEOUT;
        }
      }
      *buf++ = (uint8_t)i2c->RXDR;
    }
        // end-of-chunk
    if (!last) {
      rc = i2c_wait_flag_set(&i2c->ISR, BIT(7), 1000000); // TCR
      if (rc != I2C_OK) {
        i2c->CR2 |= BIT(14);
        return rc;
      }
    } else {
      rc = i2c_wait_flag_set(&i2c->ISR, BIT(5), 1000000); // STOPF
      if (rc != I2C_OK) {
        i2c->CR2 |= BIT(14);
        return rc;
      }
      i2c->ICR = BIT(5); // clear STOPF
    }
    len -= chunk;
  }
  return I2C_OK;
}

