Ybbor7456/stm32l432kc-baremetal/drivers/hal.h
/*
START
device address + Write
register address byte (the pointer)
data byte(s)
STOP
*/
// helper
static inline int i2c_wait_txis_or_err(struct i2c *i2c, uint32_t timeout) {
  while ((i2c->ISR & BIT(1)) == 0) {            // TXIS
    uint32_t isr = i2c->ISR;

    if (isr & BIT(4)) {                         // NACKF
      i2c->ICR = BIT(4);
      i2c->CR2 |= BIT(14);                      // STOP
      return I2C_ERR_NACK;
    }
    if (isr & BIT(8)) {                         // BERR
      i2c->ICR = BIT(8);
      i2c->CR2 |= BIT(14);
      return I2C_ERR_BUS;
    }
    if (isr & BIT(9)) {                         // ARLO
      i2c->ICR = BIT(9);
      return I2C_ERR_ARLO;
    }
    if (timeout-- == 0) {
      i2c->CR2 |= BIT(14);
      return I2C_ERR_TIMEOUT;
    }
  }
  return I2C_OK;
}

static inline int i2c_write_register(struct i2c *i2c, uint8_t dev_addr7, const uint8_t *buf, size_t len, uint8_t reg){
  if (i2c->ISR & BIT(15)) return I2C_ERR_BUSY;

  // 1) Clear sticky flags (STOPF, NACKF, BERR, ARLO)
  i2c->ICR = BIT(5) | BIT(4) | BIT(8) | BIT(9);

  bool first = true;

  while (len > 0) {
    // payload bytes to send in this segment
    uint32_t payload_chunk = (uint32_t)len;
    uint32_t max_payload   = first ? 254u : 255u;      // reserve 1 byte for reg on first segment
    if (payload_chunk > max_payload) payload_chunk = max_payload;

    // total bytes this segment = reg (first only) + payload
    uint32_t nbytes = payload_chunk + (first ? 1u : 0u);

    // more payload remains after this segment?
    bool more = (len > payload_chunk);
    bool last = !more;

    // 2) Program CR2 for this WRITE segment
    uint32_t cr2 = 0;
    cr2 |= ((uint32_t)(dev_addr7 & 0x7F) << 1);        // SADD (7-bit)
    cr2 |= (nbytes << 16);                              // NBYTES
    // RD_WRN = 0 (write) by default
    if (more) cr2 |= BIT(24);                           // RELOAD
    else      cr2 |= BIT(25);                           // AUTOEND
    cr2 |= BIT(13);                                     // START
    i2c->CR2 = cr2;
    // 3) Send register pointer once (first segment only)
    if (first) {
      int rc = i2c_wait_txis_or_err(i2c, 1000000);
      if (rc != I2C_OK) return rc;
      i2c->TXDR = reg;
      first = false;
    }
    // 4) Send payload bytes
    for (uint32_t i = 0; i < payload_chunk; i++) {
      int rc = i2c_wait_txis_or_err(i2c, 1000000);
      if (rc != I2C_OK) return rc;
      i2c->TXDR = *buf++;
    }
    // 5) End-of-segment handling
    if (!last) {
      // wait TCR before programming next segment
      int rc = i2c_wait_flag_set(&i2c->ISR, BIT(7), 1000000); // TCR
      if (rc != I2C_OK) {
        i2c->CR2 |= BIT(14);
        return rc;
      }
    } else {
      // wait STOPF (AUTOEND)
      int rc = i2c_wait_flag_set(&i2c->ISR, BIT(5), 1000000); // STOPF
      if (rc != I2C_OK) {
        i2c->CR2 |= BIT(14);
        return rc;
      }
      i2c->ICR = BIT(5);                                     // clear STOPF
    }

    len -= payload_chunk;                                    // payload remaining
  }

  return I2C_OK;
}

static inline void i2c_init(struct i2c *i2c){
  uint8_t af = 0; 
  uint16_t scl = 0, sda =0; 

  if (i2c == I2C1) RCC -> APB1ENR1 |= BIT(21); // enable i2c1 clock
  if (i2c == I2C3) RCC -> APB1ENR1 |= BIT(23); 

  if (i2c == I2C1) af = 4, sda = PIN('B', 7), scl = PIN('B', 6); 
  if (i2c == I2C3) af = 4, sda = PIN('B', 4), scl = PIN('A', 7); 

  i2c_gpio_init(scl, sda, af); 
  rcc_i2c_select_hsi(i2c);
  i2c->CR1 &= ~BIT(0); //PE = 0
  i2c->TIMINGR = 0x00503D58; // taken from CubemX, TIMINGR determines speed, not source
  i2c -> CR1 |= BIT(0); // peripheral enabled, PE = 1
}


